#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cars-organization/cars-workspace-branch-dev/runs/run-EJ6rrg7APT8rWvEz

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
random_pet.lambda_bucket_name: Refreshing state... [id=dev-cars-lambda-functions-presently-explicitly-lenient-ewe]
data.archive_file.lambda_code["Handler"]: Refreshing...
data.archive_file.lambda_code["HandlerDivide"]: Refreshing...
data.archive_file.lambda_code["Handler"]: Refresh complete after 0s [id=97275ce1a74d9ba579ae98167285c918da570f6c]
data.archive_file.lambda_code["HandlerDivide"]: Refresh complete after 0s [id=97275ce1a74d9ba579ae98167285c918da570f6c]
aws_apigatewayv2_api.lambda: Refreshing state... [id=a44klhpl9k]
aws_iam_role.lambda_exec: Refreshing state... [id=dev-serverless_lambda]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=dev-cars-lambda-functions-presently-explicitly-lenient-ewe]
aws_acm_certificate.lambda: Refreshing state... [id=arn:aws:acm:us-east-1:513968370036:certificate/44f1ff68-117a-4239-aaad-8529c038b1d3]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=dev-serverless_lambda-20230418152117672200000001]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/dev_dev_serverless_lambda_gw]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=dev_v1]
aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=dev-cars-lambda-functions-presently-explicitly-lenient-ewe,private]
aws_s3_object.lambda_code_object["Handler"]: Refreshing state... [id=dev-Handler.zip]
aws_s3_object.lambda_code_object["HandlerDivide"]: Refreshing state... [id=dev-HandlerDivide.zip]
aws_lambda_function.lambda["Handler"]: Refreshing state... [id=dev-Handler]
aws_lambda_function.lambda["HandlerDivide"]: Refreshing state... [id=dev-HandlerDivide]
aws_lambda_permission.api_gw["HandlerDivide"]: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_cloudwatch_log_group.lambda_cloudwatch_log_group["HandlerDivide"]: Refreshing state... [id=/aws/lambda/dev-HandlerDivide]
aws_cloudwatch_log_group.lambda_cloudwatch_log_group["Handler"]: Refreshing state... [id=/aws/lambda/dev-Handler]
aws_apigatewayv2_integration.lambda_apigatewayvw2_integration["HandlerDivide"]: Refreshing state... [id=r26zau3]
aws_apigatewayv2_integration.lambda_apigatewayvw2_integration["Handler"]: Refreshing state... [id=d5gz7ph]
aws_lambda_permission.api_gw["Handler"]: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_route.lambda_apigatewayvw2_route["HandlerDivide"]: Refreshing state... [id=k7pkdnt]
aws_apigatewayv2_route.lambda_apigatewayvw2_route["Handler"]: Refreshing state... [id=durtwfu]
aws_cloudwatch_log_group.lambda_cloudwatch_log_group["HandlerDivide"]: Drift detected (update)
aws_cloudwatch_log_group.lambda_cloudwatch_log_group["Handler"]: Drift detected (update)
aws_apigatewayv2_stage.lambda: Drift detected (update)
aws_apigatewayv2_api.lambda: Drift detected (update)
aws_s3_object.lambda_code_object["Handler"]: Drift detected (update)
aws_s3_object.lambda_code_object["HandlerDivide"]: Drift detected (update)
aws_apigatewayv2_integration.lambda_apigatewayvw2_integration["Handler"]: Drift detected (update)
aws_apigatewayv2_integration.lambda_apigatewayvw2_integration["HandlerDivide"]: Drift detected (update)
aws_iam_role.lambda_exec: Drift detected (update)
aws_s3_bucket.lambda_bucket: Drift detected (update)
aws_lambda_function.lambda["HandlerDivide"]: Drift detected (update)
aws_lambda_function.lambda["Handler"]: Drift detected (update)
aws_apigatewayv2_route.lambda_apigatewayvw2_route["Handler"]: Drift detected (update)
aws_apigatewayv2_route.lambda_apigatewayvw2_route["HandlerDivide"]: Drift detected (update)
aws_cloudwatch_log_group.api_gw: Drift detected (update)
aws_acm_certificate.lambda: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ROLE_ARN" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-EJ6rrg7APT8rWvEz/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "CLOUDFLARE_EMAIL" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-EJ6rrg7APT8rWvEz/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_api_mapping.lambda will be created
  + resource "aws_apigatewayv2_api_mapping" "lambda" {
      + api_id      = "a44klhpl9k"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = "dev_v1"
    }

  # aws_apigatewayv2_domain_name.lambda will be created
  + resource "aws_apigatewayv2_domain_name" "lambda" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "dev.api.carsdemo.win"
      + id                               = (known after apply)
      + tags_all                         = (known after apply)

      + domain_name_configuration {
          + certificate_arn                        = "arn:aws:acm:us-east-1:513968370036:certificate/44f1ff68-117a-4239-aaad-8529c038b1d3"
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # aws_lambda_function.lambda["Handler"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "dev-Handler"
      ~ last_modified                  = "2023-04-18T15:21:39.733+0000" -> (known after apply)
      ~ source_code_hash               = "groazx3CSU6zr9MWKbsLuoRf3E53ZTYsxSXYsWabwVI=" -> "s3MjOCE0RDFPc2cbWcRkn/gWlcIbdqmWTqpdRakV5n8="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.lambda["HandlerDivide"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "dev-HandlerDivide"
      ~ last_modified                  = "2023-04-18T15:21:39.728+0000" -> (known after apply)
      ~ source_code_hash               = "groazx3CSU6zr9MWKbsLuoRf3E53ZTYsxSXYsWabwVI=" -> "s3MjOCE0RDFPc2cbWcRkn/gWlcIbdqmWTqpdRakV5n8="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.lambda_code_object["Handler"] will be updated in-place
  ~ resource "aws_s3_object" "lambda_code_object" {
      ~ etag                   = "ee03ee0d721b5ec8db369a85fc779358" -> "f8b63d871951985260656bda9f7d4321"
        id                     = "dev-Handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_code_object["HandlerDivide"] will be updated in-place
  ~ resource "aws_s3_object" "lambda_code_object" {
      ~ etag                   = "ee03ee0d721b5ec8db369a85fc779358" -> "f8b63d871951985260656bda9f7d4321"
        id                     = "dev-HandlerDivide.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

```

</details>800.513.328

*Pushed by: @paol-imi, Action: `pull_request`*